Laravel
ドッカーのインストール、laravelの基礎知識
getメソッドの使い方
ファイルのインポート、ダウンロード、削除方法
フォーム入力画面と入力データのバリデーション
エラーメッセージ
メール送信機能
DB マイグレーション、ロールバック
ブログ一覧画面
投稿記事の追加、編集、削除、並び替え
ユーザー登録
ログイン機能
auth,guestメソッド
セキュリティ対策

Laravel学習おさらい開始
環境の構築
ビューファイル、レイアウトの作成、コントローラー
クエリーパラメーター、ルートパラメーター
ファイルのアップロード、削除、ダウンロード

猫カフェサイト
バリデーション
電話番号の正規表現でのチェック
フォームリクエスト
マイグレーション(DB定義をPHPコードにて管理する)、ロールバック
モデル、データの追加、編集
DBから取得するデータを指定するクエリービルダー
DB以外の配列要素に検索、集計が行えるようになるコレクション（配列のアップグレード版）
リレーション、外部キー設定
1対多、多対多のリレーション

自作挑戦
バリデーション用ファイル「リクエストフォーム」を作成
メール用パッケージ mailable クラスの作成
